{"post_id": "1fu4ttn", "comment_id": "lpwtpa3", "parent_id": "t3_1fu4ttn", "depth": 0, "body": "I wish I found wgu sooner! Started my journey today and I’m so motivated! Never got this meluvh help and attention in college than with wgu. The mentor(s), instructor help, the peers. It’s truly unmatched.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lpwtpa3/"}
{"post_id": "1fu4ttn", "comment_id": "lpx4ct9", "parent_id": "t3_1fu4ttn", "depth": 0, "body": "[deleted]", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lpx4ct9/"}
{"post_id": "1fu4ttn", "comment_id": "lpxpjbj", "parent_id": "t3_1fu4ttn", "depth": 0, "body": "Just for accuracy, SNHU costs $330/credit, so basically $1000 per class. If you do at least 5 classes per term, WGU is cheaper", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lpxpjbj/"}
{"post_id": "1fu4ttn", "comment_id": "lq1iita", "parent_id": "t3_1fu4ttn", "depth": 0, "body": "I chose it because of the affordability factors, their transfer policy, and their program catalog.\n\nAs OP mentioned, WGU is very affordable compared to other colleges. Additionally, their transfer policy accepts ACE,  CLEP, and most accrsitted college credits, which means that you can tranfer in a substantial amount of credits to your program, which can make it more affordable that what it already is. Moreover, being able to accelerate classes, makes the affordability factor even better. Finally, I was looking for a school that offered specialized programs in IT, not just computer science. In particular, I was looking for a Software Engineering program, which they have!", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lq1iita/"}
{"post_id": "1fu4ttn", "comment_id": "lpylvfa", "parent_id": "t3_1fu4ttn", "depth": 0, "body": "[removed]", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lpylvfa/"}
{"post_id": "1fu4ttn", "comment_id": "lq150xw", "parent_id": "t1_lpwtpa3", "depth": 1, "body": "Look I’ll start off with this: this isn’t a bash to WGU I’ll say that. My enrollment, 1st course mentor they were the OG’s the PA instructors amazing. So there are good people there. But here’s my timeline.\n\nDid you just get started? Because I’ll say yes my enrollment was great got all the help I needed but when I started my term in the beginning it was good until I’ve noticed my mentor quit, then my next mentor was fired, my 3rd mentor was never available so I requested a new one, my 4th one is ok but has been recently been unavailable for weeks out, now my 5th one(due to the program change) apparently is on vacation and told me tier one support can help(how ever they can help Sooo I’m SOL until he returns) The instructors that were PA’s were always the best ones when it came to instructors with OA’s they were horrible. Never responded to emails(unless you spammed them) would always try to rush appointment calls, and always gave the “how can I help” statement with the response of are you studying harder? Are you using the study group? Knowing instructors can help you know how many questions=passing, or what’s on the test until after you take it is kind shocking. \n\nTheres no reason for a student like me to have gone though 5 mentors(7 if you count enrollment and first course mentor) I get it people deserve breaks and vacations but like is there no back up mentor/sub mentor then a “tier 1 support” who can’t approve anything until my mentor returns. \n\nWith everything going on I’ve sadly lost motivation to this degree and transfer elsewhere.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lq150xw/"}
{"post_id": "1fu4ttn", "comment_id": "lqhr5bk", "parent_id": "t1_lpwtpa3", "depth": 1, "body": "I will be starting soon Nov.1st if my transcript makes it in time. I am transferring in with 30 credits. What is your major? Lmk how your courses go in a few weeks and how fast you are able to complete them.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqhr5bk/"}
{"post_id": "1fu4ttn", "comment_id": "lqhqjsr", "parent_id": "t1_lpx4ct9", "depth": 1, "body": "Right, I never excelled in long semester classes and my transcript reflects that, after a few weeks I start losing interest and am ready to move on. When I transferred to my second school all I would take was mini semester that lasted about 4-8 weeks and signed up for about 2-3 courses each term. It's just straight work and less bs like projects and useless research papers on things like inventors and their life.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqhqjsr/"}
{"post_id": "1fu4ttn", "comment_id": "lqhsdei", "parent_id": "t1_lpxpjbj", "depth": 1, "body": "Yes, I just did a rough average of SNHU, Keiser, Prude, etc. Most run around $400 depending on the course and me being a science major that need labs so it will be on the high side for me. That's $330 for undergraduates and then twice that for graduates which is ridiculous.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqhsdei/"}
{"post_id": "1fu4ttn", "comment_id": "lqhj4pe", "parent_id": "t1_lq1iita", "depth": 1, "body": "Some of the same reasons I applied. But I applied for Health Science. I've watched a lot of reviews about is a degree from WGU worth it, they mostly say the same thing and they've all gone the same IT route as you mentioned when you compare WGU to any major online university like Prude, SNHU, Keiser, etc. They simply do not compare when it comes to affordability, transferability, and accelerated classes. Also, the reverse transfer is something else I look forward to utilizing since they don't offer foreign language which I only need to complete one more class to satisfy the requirement for my AA degree.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqhj4pe/"}
{"post_id": "1fu4ttn", "comment_id": "lpyo0aa", "parent_id": "t1_lpylvfa", "depth": 1, "body": "Why don’t you like the guardian browser? I don’t mind it at all.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lpyo0aa/"}
{"post_id": "1fu4ttn", "comment_id": "lq1201j", "parent_id": "t1_lpylvfa", "depth": 1, "body": "Definitely agree on this, the proctor stuff has gotten worse, and the bs script of mentors telling me “how can I help you with passing this OA” only to be told oh you need to study harder and use our new study hall.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lq1201j/"}
{"post_id": "1fu4ttn", "comment_id": "lqht8fy", "parent_id": "t1_lpylvfa", "depth": 1, "body": "I've taken course with guardian browsers and records you, they just want to make sure you're competent in your studies. It doesn't bother me much. Did y'all use something like Honorlock?", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqht8fy/"}
{"post_id": "1fu4ttn", "comment_id": "lqid2t1", "parent_id": "t1_lqhsdei", "depth": 2, "body": "Yeah I wouldn't have gone to SNHU under \"normal\" circumstances like for 120 credits, but I was able to transfer in my gen eds from previous school, and then take several other classes on Sophia plus the Google Data Analytics certificate, to cut it down to the minimum 30 credits required in-house and only pay $10k to SNHU. I was even able to get an Applied Math minor with that. I would not get a masters there because of the double cost per class as you said.\n\nNow, after a year of seeing how few actually entry level data analyst positions are around I'm taking computer science study.com classes in preparation for WGU's BS CS to qualify for a much broader range of jobs, and for masters in CS programs. \n\nFrom what I have seen, most people are able to go at least a little faster than the \"standard\" 4 classes per term, but the people who do an entire degree in 6 months generally have many classes transferred in, lots of free time, and already have years of experience in the field, so all the classes are basically just a quick refresher to skim through before they take the test.\n\nFrom WGU's own stats on their website, it seems like actual students in the business degrees take an average of 1.5-2 years, education averages 3 years, tech ~2.5-3 years, and healthcare ~2 years", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqid2t1/"}
{"post_id": "1fu4ttn", "comment_id": "lqhk6w8", "parent_id": "t1_lqhj4pe", "depth": 2, "body": "That is another great point that I didn't know WGU offered. The reverse transfers allowed me to get my Associates degree!\n\nI am getting an Associates degree in Pierpont Community and Technical College. Since they allow both ACE credits transfers and WGU reverse credits. I transferred all, and they confirmed I am ready for graduation. I just need to sit tight for the December graduation.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqhk6w8/"}
{"post_id": "1fu4ttn", "comment_id": "lpyoub8", "parent_id": "t1_lpyo0aa", "depth": 2, "body": "[removed]", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lpyoub8/"}
{"post_id": "1fu4ttn", "comment_id": "lqm37am", "parent_id": "t1_lqht8fy", "depth": 2, "body": "[removed]", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqm37am/"}
{"post_id": "1fu4ttn", "comment_id": "lqmke7g", "parent_id": "t1_lqid2t1", "depth": 3, "body": "It is possible. They are a lot of students who can and have finished a course or two within a week. I've taken mini semesters at college finishing 3 courses within 4 weeks. But then again, WGU doesn't do credit hours or have set schedules. They offer equivalent competency units, which main focuse is mastering the subject at your own pace and moving on. They are no weekly deadlines, no discussion post, no unnecessary projects, or research papers. Without all that extra fluff, students can truly focus on completing the units and moving on. I love the fact you are studying before hand. I feel like a lot of ppl should do that and research to prepare themselves so they don't feel overwhelmed and act like they didn't know what they were getting into.\n\n\nI wrote out a lot more replying to everything but I erased it to try and keep it short. But honestly as I think about it, I don't believe WGU would be the best fit for first-time students and transfering in credits is a big boost. Only thing I wish I would've finish before transfering in is my second foreign language. I'm going to have to try and dual enroll to complete Spanish 2. WGU dosent offer foreign languages which is the only negative thing I've personally came across so far.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqmke7g/"}
{"post_id": "1fu4ttn", "comment_id": "lqhskt3", "parent_id": "t1_lqhk6w8", "depth": 3, "body": "Heck yea, awsome man. Congrats.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqhskt3/"}
{"post_id": "1fu4ttn", "comment_id": "lpz5q9y", "parent_id": "t1_lpyoub8", "depth": 3, "body": "[deleted]", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lpz5q9y/"}
{"post_id": "1fu4ttn", "comment_id": "lqmlez1", "parent_id": "t1_lqm37am", "depth": 3, "body": "I understand your frustration. I've only used guardian browser in school so I never had that problem since the proctor set everything up. I used Honorlock at my last school which is more like an plug-in you can enable on chrome, but it's very simple and straight forward. Honorlock records you, your screen and don't allow you to go back or open other tabs also have to keep your face in the camera. Can you tell me more about the guardian browser WGU use.", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lqmlez1/"}
{"post_id": "1fu4ttn", "comment_id": "lq0gfaq", "parent_id": "t1_lpz5q9y", "depth": 4, "body": "[removed]", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lq0gfaq/"}
{"post_id": "1fu4ttn", "comment_id": "lq12bzk", "parent_id": "t1_lpz5q9y", "depth": 4, "body": "You must be a lucky person then. Because I’m the same case of affect. Had to wait a total of 6 hours a few separate times just to try to get a proctor only to be given an excuse about my room, my accommodations, or service isn’t good. Never had a single issue with examity. I wish they wasn’t bought. But monopoly it is", "permalink": "https://reddit.com/r/WGU/comments/1fu4ttn/why_i_chose_wgu/lq12bzk/"}
