{"post_id": "1iau6zj", "comment_id": "m9ed14l", "parent_id": "t3_1iau6zj", "depth": 0, "body": "you're at the finish line now, so it won't really matter.  But for anyone that finds or sees this int he future,  draft a weekly \"what i'm doing\" email for your Mentor and maybe the CI for a class that's active, and send it on Tuesday.   It keeps you active b/c it counts as attendance.", "permalink": "https://reddit.com/r/WGU/comments/1iau6zj/inactivity_withdrawal/m9ed14l/"}
{"post_id": "1iau6zj", "comment_id": "m9dht74", "parent_id": "t3_1iau6zj", "depth": 0, "body": "That is crazy! And to think, I was getting annoyed when the instructor kept asking me when I planned to take my retake exam.", "permalink": "https://reddit.com/r/WGU/comments/1iau6zj/inactivity_withdrawal/m9dht74/"}
{"post_id": "1iau6zj", "comment_id": "m9f9zyo", "parent_id": "t3_1iau6zj", "depth": 0, "body": "That's normal. It used to happen to me when I was working on projects. All you need to do is log into your current course and click around inside the course. WGU has no way of knowing that you're on an outside project. You're almost at the end so it won't affect you. Just remember to log in again in the next two weeks, if you are still working on this project.", "permalink": "https://reddit.com/r/WGU/comments/1iau6zj/inactivity_withdrawal/m9f9zyo/"}
{"post_id": "1iau6zj", "comment_id": "m9kbsfa", "parent_id": "t3_1iau6zj", "depth": 0, "body": "About to start term 2 and have not found a clinical site..it’s so frustrating. Anyone in Los Angeles willing to precept me?? I’m in the RN to BSN program. I’ve been a nurse for 4 yrs! Help :(", "permalink": "https://reddit.com/r/WGU/comments/1iau6zj/inactivity_withdrawal/m9kbsfa/"}
{"post_id": "1iau6zj", "comment_id": "m9eqlbu", "parent_id": "t1_m9ed14l", "depth": 1, "body": "And to piggy back off what you said. Those that are in the program, just need to click on a page(s), a test something for a few minutes . They can see anything you clicked and that will show you in a class vs inactivity.", "permalink": "https://reddit.com/r/WGU/comments/1iau6zj/inactivity_withdrawal/m9eqlbu/"}
{"post_id": "1iau6zj", "comment_id": "m9kla4a", "parent_id": "t1_m9kbsfa", "depth": 1, "body": "Took me 6 months of actively looking and getting turned down. I almost think they plan it to take that long so you buy an extra term.", "permalink": "https://reddit.com/r/WGU/comments/1iau6zj/inactivity_withdrawal/m9kla4a/"}
{"post_id": "1iau6zj", "comment_id": "m9qqx2i", "parent_id": "t1_m9kla4a", "depth": 2, "body": "Omg my preceptor telling me to take a month off. I’m so annoyed. Do they even check for affiliation? What is it that they even check!?", "permalink": "https://reddit.com/r/WGU/comments/1iau6zj/inactivity_withdrawal/m9qqx2i/"}
