{"post_id": "1ipzgri", "comment_id": "mcxj227", "parent_id": "t3_1ipzgri", "depth": 0, "body": "Hey so I transferred 9 credits into a bachelors had no degree prior and limited experience before I started my program (a different program than yours) biggest thing:\nTalk to your mentor and change mentors if they do not align with how you want to pursue your education.\nI have bipolar so I have times where I can get done 5-7 classes a week and times where I do nothing other then brush my teeth. \nMy first term my mentor and I didn’t flow well and I completed 22 credits (7 classes) this term I have a new mentor who works with me on my terms.\nThis weekend she was going to be gone so she moved up 4 classes for me because if I run out of classes I lose momentum I start them 1 at a time like I’m supposed to. I’m two months into my second term I’m already at 34 credits that’s 12 classes and I spent 3 weeks on one of the classes I struggled with hard. Biggest thing is to communicate and make sure ur mentor and you have a collaborative relationship.", "permalink": "https://reddit.com/r/WGU_Accelerators/comments/1ipzgri/help_new_student_looking_to_accelerate/mcxj227/"}
{"post_id": "1ipzgri", "comment_id": "mcx53tf", "parent_id": "t3_1ipzgri", "depth": 0, "body": "My experience was in a different program. They set my up with one class at a time. As soon as I finished a class I would call the help desk and they would open the next class. The mentors don't really do anything. Their job is to try to stop you from dropping out, but in my experience they dont serve any actual purpose. Mine was nice but not very helpful. \n\nIf theres an Objective Assessment, take the pre assessment (it's really a practice final). If you pass that, just immediately take the final. You can typically schedule within an hour. Make sure your tech set up meets the proctoring requirements and just go for it. You can try again if you fail, but if you pass you can move to the next class. \n\nGood luck!", "permalink": "https://reddit.com/r/WGU_Accelerators/comments/1ipzgri/help_new_student_looking_to_accelerate/mcx53tf/"}
{"post_id": "1ipzgri", "comment_id": "mcznym0", "parent_id": "t1_mcxj227", "depth": 1, "body": "Thank you so much!", "permalink": "https://reddit.com/r/WGU_Accelerators/comments/1ipzgri/help_new_student_looking_to_accelerate/mcznym0/"}
{"post_id": "1ipzgri", "comment_id": "mcznwz5", "parent_id": "t1_mcx53tf", "depth": 1, "body": "Thank you so much!", "permalink": "https://reddit.com/r/WGU_Accelerators/comments/1ipzgri/help_new_student_looking_to_accelerate/mcznwz5/"}
{"post_id": "1ipzgri", "comment_id": "n7dwsak", "parent_id": "t1_mcx53tf", "depth": 1, "body": "This is incorrect as Tier 1 has less power than your mentor. Your mentor can release a full term at a time if they feel you can handle it. Tier 1 is there so you don’t have to contact them as much but in my case for example, if I finish a paper in a day and another the next, tier 1 will not approve the next class until my tasks are no longer pending. \n\nMeanwhile a mentor can see my personal history of not having too many revisions and trust that I can continue on to the next class without struggling.", "permalink": "https://reddit.com/r/WGU_Accelerators/comments/1ipzgri/help_new_student_looking_to_accelerate/n7dwsak/"}
{"post_id": "1ipzgri", "comment_id": "n7folvx", "parent_id": "t1_n7dwsak", "depth": 2, "body": "That's great for you. That was not my experience, so I found going to Tier 1 faster than going to my mentor. I'm sure mentors vary and some are more helpful or more lenient than others. You lucked out and got a good one.", "permalink": "https://reddit.com/r/WGU_Accelerators/comments/1ipzgri/help_new_student_looking_to_accelerate/n7folvx/"}
