{"post_id": "1n7051o", "comment_id": "nc3xwaq", "parent_id": "t3_1n7051o", "depth": 0, "body": "My husband got his degree from WGU several years ago and he did the same thing when he first started. Flew through classes. Several a week sometimes. It was fine. It also slowed down a lot when he got to new material he hadn’t seen before.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc3xwaq/"}
{"post_id": "1n7051o", "comment_id": "nc41cn2", "parent_id": "t3_1n7051o", "depth": 0, "body": "Never heard of anyone having a problem for completing too fast. The whole point of competency based education is that people who already know the material don't need to waste time, they can go straight to demonstrating their competency. \n\nWhen I got my bachelors I completed two, occasionally three, courses a week, no issues.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc41cn2/"}
{"post_id": "1n7051o", "comment_id": "nc47nq7", "parent_id": "t3_1n7051o", "depth": 0, "body": "Welcome to WGU - the place where some things that seem too good to be true actually are.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc47nq7/"}
{"post_id": "1n7051o", "comment_id": "nc41g9m", "parent_id": "t3_1n7051o", "depth": 0, "body": ">*Is there a such thing as completing too fast?*\n\nNo", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc41g9m/"}
{"post_id": "1n7051o", "comment_id": "nc4bvky", "parent_id": "t3_1n7051o", "depth": 0, "body": "Wait until you hit the core material you’ve not seen yet. Then come back to this post lol.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4bvky/"}
{"post_id": "1n7051o", "comment_id": "nc4oqor", "parent_id": "t3_1n7051o", "depth": 0, "body": "So you are concerned about finishing a course too fast, yet you want to complete your degree in one 6 month term… think about that  for a minute….", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4oqor/"}
{"post_id": "1n7051o", "comment_id": "nc4enty", "parent_id": "t3_1n7051o", "depth": 0, "body": "Just finished my first term and completed 50 credits. I have 18 left to finish my degree and I'm guessing it's gonna end up taking the majority of these next 6 months", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4enty/"}
{"post_id": "1n7051o", "comment_id": "nc4fofo", "parent_id": "t3_1n7051o", "depth": 0, "body": "You’re good. Relax. You’ll slow down when the times right, don’t self-sabotage by slowing your roll- if you still got gas in your engine, you must go!!!! :)", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4fofo/"}
{"post_id": "1n7051o", "comment_id": "nc4jv87", "parent_id": "t3_1n7051o", "depth": 0, "body": "What are the 3 classes?  \n\nSubmitting the PA’s is fine. It’s basically an assessment to let you know what you know and what you need improvement on. But don’t let the PA’s fool you either. Passing the OA is what really matters. \nThere is no such thing as moving too fast. Eventually it will come to a pause or you will be able to have a mental break until your next set of classes start. 💫✨💫✨", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4jv87/"}
{"post_id": "1n7051o", "comment_id": "nc5qfqs", "parent_id": "t3_1n7051o", "depth": 0, "body": "My ex wife certainly thought so", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc5qfqs/"}
{"post_id": "1n7051o", "comment_id": "nc6fwoq", "parent_id": "t3_1n7051o", "depth": 0, "body": "Premature e-graduation.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6fwoq/"}
{"post_id": "1n7051o", "comment_id": "nc6i3tk", "parent_id": "t3_1n7051o", "depth": 0, "body": "When I started I was doing 2 classes a week because I too knew the material 😂 now the oomph has worn off, the new material is challenging, and I’m plugging through more slowly. About a class every 2 weeks 😆🫠", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6i3tk/"}
{"post_id": "1n7051o", "comment_id": "nc4zaaa", "parent_id": "t3_1n7051o", "depth": 0, "body": "I completed four IT courses last week. Submit those assignments and complete your degree as fast as you want.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4zaaa/"}
{"post_id": "1n7051o", "comment_id": "nc5om4m", "parent_id": "t3_1n7051o", "depth": 0, "body": "Submit it. The whole system is built around “go at your own pace”. If your pace is finishing those courses quickly then it’s your pace. If they have an issue with it then it’s a flawed system.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc5om4m/"}
{"post_id": "1n7051o", "comment_id": "nc5zzgo", "parent_id": "t3_1n7051o", "depth": 0, "body": "Back in my day (when we had to walk up hill both ways in the snow to access our computer and log in), WGU let you preview the classes before you enrolled in them or before they were even in your current term. You could see what was required and even see all the material prior to enrolling in it, so it was very common to look at it, do the paper or study the material, talk to your PM, add the course and complete it immediately.\n\nOnce I hit OTP for a term, that's what my checkins became. Me: \"I looked at XYYY class, got the paper ready to submit and put in a request to move it to my current term.\" PM: \"Done, activate it and good luck\"", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc5zzgo/"}
{"post_id": "1n7051o", "comment_id": "nc6qomo", "parent_id": "t3_1n7051o", "depth": 0, "body": "I completed all of my first term planned classes in the first week of the term. Submit them and move on to the next one. Take advantage of being able to complete more than just 3-4 classes a term.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6qomo/"}
{"post_id": "1n7051o", "comment_id": "nc6y0dx", "parent_id": "t3_1n7051o", "depth": 0, "body": "I completed my rn-bsn w WGU in 4 mo and that was with taking a week off here and there. crank it out!", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6y0dx/"}
{"post_id": "1n7051o", "comment_id": "nc6zuaw", "parent_id": "t3_1n7051o", "depth": 0, "body": "I was worried about that as well. Finished in 3 weeks and was like that can't be it.... it in fact was!", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6zuaw/"}
{"post_id": "1n7051o", "comment_id": "nc7qhwh", "parent_id": "t3_1n7051o", "depth": 0, "body": "No lots of people accelerate like this!", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc7qhwh/"}
{"post_id": "1n7051o", "comment_id": "nc9qy4g", "parent_id": "t3_1n7051o", "depth": 0, "body": "This is really the entire idea of WGU - was originally designed for people working in related fields looking to move up/on.\n\nIt’s fine.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc9qy4g/"}
{"post_id": "1n7051o", "comment_id": "ncewefh", "parent_id": "t3_1n7051o", "depth": 0, "body": "Nope. I’m in the HIM program and have been in HIM professionally for almost 20 years. I have tested out of quite a few courses.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/ncewefh/"}
{"post_id": "1n7051o", "comment_id": "nco22lk", "parent_id": "t3_1n7051o", "depth": 0, "body": "Nope! When I got my bachelors I would do school 10+ hours a day over the summer. I had a couple weeks where I finished 3+ classes. It was great. As long as you’re working hard and doing your own work, you shouldn’t have any problems. Keep in touch with your mentor and don’t be quiet about your plans or how hard you’re working. You got this!!!", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nco22lk/"}
{"post_id": "1n7051o", "comment_id": "nc3z4zx", "parent_id": "t1_nc3xwaq", "depth": 1, "body": "This is truth. Economics kicked my ass, but the rest has been a breeze. They make it easy to work full time and also go to school.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc3z4zx/"}
{"post_id": "1n7051o", "comment_id": "nc6y9zv", "parent_id": "t1_nc3xwaq", "depth": 1, "body": "Agree. Some classes I can finish in a day or a week. If it’s a test with a lot of memorization for a certain or a test involving programming questions it usually takes me a month of studying until I feel comfortable. Tests set me back but projects I can fly through.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6y9zv/"}
{"post_id": "1n7051o", "comment_id": "nc4i0i9", "parent_id": "t1_nc41cn2", "depth": 1, "body": "Hello\nI am working on my Sophia learning classes right now to add to some already transferred classes. How were the core classes that WGU requires us to take? Fairly simple?", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4i0i9/"}
{"post_id": "1n7051o", "comment_id": "nc4oi0z", "parent_id": "t1_nc4jv87", "depth": 1, "body": "You are confusing pre-assessment with performance assessment… All classes have the pre-assessment. Some classes have a PA (Performance Assessment), like a paper, or an OA (objective assessment) proctored exam.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4oi0z/"}
{"post_id": "1n7051o", "comment_id": "nc5mhfr", "parent_id": "t1_nc3z4zx", "depth": 2, "body": "It's kicking mine right now 🤣", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc5mhfr/"}
{"post_id": "1n7051o", "comment_id": "nc4iq34", "parent_id": "t1_nc4i0i9", "depth": 2, "body": "When you say core classes, do you mean like the gen eds? If so, I did not take those at WGU either, I also did Sophia, and a little Study .com, first and transferred them in. As for the classes I did take at WGU I did not find them particularly difficult, mostly just make sure to follow all the rubric requirements for written tasks, and make sure to study everything covered in the pretest for the tests. \n\nIf I were to generally compare them to what I did at Sophia, I would say pretty close, some courses a little more difficult though.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc4iq34/"}
{"post_id": "1n7051o", "comment_id": "nc65xyk", "parent_id": "t1_nc4oi0z", "depth": 2, "body": "No, I asked what classes that they were taking for a reason. I wasn’t sure if it was the Pre-Assessment, Performance Assessment, or Objective Assessment considering it was said they just started.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc65xyk/"}
{"post_id": "1n7051o", "comment_id": "nc6jaqq", "parent_id": "t1_nc5mhfr", "depth": 3, "body": "You got this! My advice is 1. Learn the basic graphs and draw them out on your whiteboard after your exam starts. Reference back to the graphs throughout the test. Have a calculator- I promise. Even if you can do it. Just… calculator. \n\nFinally, don’t get too in your head. That’s what happened my first attempt, I panicked and scored really bad. That was ok though, the course instructor is really nice. She TALKED ME DOWN from my panic and then went over the content I was struggling with. Despite everything, I’m better for the experience. I never want to see economics ever again though haha!", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6jaqq/"}
{"post_id": "1n7051o", "comment_id": "nc77q6m", "parent_id": "t1_nc4iq34", "depth": 3, "body": "How long did it take you to get your degree??", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc77q6m/"}
{"post_id": "1n7051o", "comment_id": "nc6miqn", "parent_id": "t1_nc65xyk", "depth": 3, "body": "Bullshit. You described a pre assessment, stating that it is to see what you know and what you need improvement on… then said the OA is what matters. Obviously the OP is speaking about the performance assessment since they stated that they had completed the requirements for 3 courses already because they knew the material… and they worked on it for 2 whole days…. The OP was obviously writing papers.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6miqn/"}
{"post_id": "1n7051o", "comment_id": "nc6prfn", "parent_id": "t1_nc6jaqq", "depth": 4, "body": "Yes. Im only giving myself this week to review more and take the OA, its just such a boring class. Maybe hearing more of the repeat will help me, I just need a little higher on the PA before im confident in the OA", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc6prfn/"}
{"post_id": "1n7051o", "comment_id": "nc7ba8o", "parent_id": "t1_nc77q6m", "depth": 4, "body": "I transferred in 4 classes from community college many years ago, then spent two months on Sophia, two months on Study .com, a month to transfer my credits in and get enrolled at WGU, and then I finished my last courses with WGU over two months.\n\nBut the things that I was going over in the classes were things I was mostly already familiar with through work experience and other training I have taken.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc7ba8o/"}
{"post_id": "1n7051o", "comment_id": "nc70xzb", "parent_id": "t1_nc6miqn", "depth": 4, "body": "I asked a question first. There is nothing to go back and forth about. Even if it’s either Pre-Assessment or Performance Assessment, things still may change in future classes. I’m in the RN/BSN program and I only have Pre-Assessments and Objective Assessments. The Objective Assessments in my opinion aren’t the easiest.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc70xzb/"}
{"post_id": "1n7051o", "comment_id": "nc86p0b", "parent_id": "t1_nc70xzb", "depth": 5, "body": "It is not either pre-assessment or Performance Assessment... they are two very different things.\n\nPre-assessment is the quiz you have access to when you start a course to see what your knowledge level is. You can take these over and over, they are the same questions every time, and they do not count for course credit. You are not required to pass these in order to get credit for the class. This is not what is being referred to by WGU students on Reddit when they say PA. Nobody cares about these.\n\nWhat WGU students refer to as a PA is the Performance Assessment. This involves writing a research paper, or writing a business plan, or project plan, or a lab depending upon the program you are in. Some courses with a PA can be completed in a day easily if you already know the material. Your pass / fail on these count and passing these are required for course credit.\n\nThe OA, or Objective Assessment, is the typical multiple choice style exam. These are proctored exams and depending on program, may be third party certification exams. These also require you to pass in order to get credit for a course.", "permalink": "https://reddit.com/r/WGU/comments/1n7051o/is_there_a_such_thing_as_completing_too_fast/nc86p0b/"}
