{
  "post": {
    "post_id": "1ggolwa",
    "title": "Thinking of RN-BSN",
    "selftext": "Hello, This is my first time posting on this subreddit since I'm a lurker on here lol. I am in a BSN program at my school, its just really expensive and I was thinking of doing my school's ASN program instead and finishing up at WGU for my BSN. If WGU takes all my credits I would probably only need to take about 9 to 11 of these classes. https://preview.redd.it/4hsh30nqk5yd1.png?width=1082&format=png&auto=webp&s=7af82b9b3cacdf8e4775b7b65d6cd740b3c637dd I would save anywhere from $20k-$23k in loans taking this route since my current school is so expensive. Would you recommend the program? How long did each class take? What do you wish you could've done differently or that WGU could have done differently? And how long did it take you to complete the RN-BSN program? I'd love to get some information and save myself from a student debt hole. I was already thinking of doing WGU's MSN program after a few years as a staff nurse, so if anyone has any info on that, I'd love to hear it as well.",
    "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/"
  },
  "comments": [
    {
      "comment_id": "lwzngzj",
      "body": "Hey there! I've recently graduated from WGU with my MSN. I highly recommend it! \nThe price is definitely right. \nAnd depending on how disciplined you are, you can get through courses quickly. Pro tip: when your assignment is being graded it take a couple of days so start on the next assignment in the meantime. \n\n\nAt times I was able to finish a class in a couple of weeks but I juggle full time job amongst other things so how long a class takes depends on you and your determination to get it done sooner than later. \n\n\nDefinitely meet with your course instructor before beginning classes and definitely before taking an assessments (exams), it can be overwhelming to see the amount of information that you need to study. But they have insight and can help you navigate through the content. \n\n\nIf I was more disciplined I could've finished sooner but if that's your goal, have a plan and stick to it 😀",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lwzngzj/",
      "replies": [
        {
          "comment_id": "lx0hscx",
          "body": "Thank you so much for your insight! I have already started the process to switch to my school’s ASN program, but was still unsure about what to do once I graduate. First hand experience is so helpful.",
          "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx0hscx/",
          "replies": [
            {
              "comment_id": "lx0mb5s",
              "body": "You're welcome. Best wishes to you!!",
              "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx0mb5s/",
              "replies": []
            }
          ]
        },
        {
          "comment_id": "lz9fsv9",
          "body": "Hi! I am planning on starting my MSN in Leadership and management in June. I’m a school nurse and that will give me almost 3 months full time to work on the program. Is it possible to finish the MSN in one term?",
          "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lz9fsv9/",
          "replies": [
            {
              "comment_id": "lzhjkac",
              "body": "Are you transferring credits in? If not, that's a really tight schedule. I've heard of someone who completed MSN in 5 months. The core classes which are the first year can be done quickly but the 2nd year which involves capstone could take more time. Tip: start the next assignment while waiting for the current assignment to be graded, hope that makes sense. \nSearch forums on here and see if anyone has completed in the desired timeframe and make a plan that works for you.",
              "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lzhjkac/",
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "comment_id": "lx3vsr2",
      "body": "I completely my BSN and MSN through WGU. It took my about 16 months for my BSN. I LOVED the fact that it was self paced and I could breeze through the courses that I already had experience in. They saved me so much money in student loans by the one cost terms. The teachers are amazing and the support is like no other! My only regret is that I didn’t start with them sooner! \n\nFor my MSN, I was already comfortable with the WGU model and so I excelled in it! I completed my MSN in 4 1/2 months. Again, amazing teachers and support. I love WGU and I’m so proud to be an alumni!",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx3vsr2/",
      "replies": [
        {
          "comment_id": "m40guqg",
          "body": "WOW 4.5 months is super impressive and extremely motivating.  Way to go",
          "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/m40guqg/",
          "replies": []
        }
      ]
    },
    {
      "comment_id": "lx01coa",
      "body": "I can't speak to the BSN program, but I recently transferred into the MSN program at WGU and am loving it so far!  I was doing an online program at a private school for my MSN and couldn't afford it.  When I started looking for options, WGU was a no-brainer with the difference in cost!  I'm only in my first class, but can already tell I'll be much more successful here than I was at my previous school. The format of the classes is different but much more enjoyable, in my opinion!",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx01coa/",
      "replies": [
        {
          "comment_id": "lx0i03w",
          "body": "I’m glad to hear it’s working for you! I also saw the have a direct RN to MSN program and was looking at that as well. And yes the costs are honestly my biggest reasoning behind switching to WGU.",
          "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx0i03w/",
          "replies": []
        }
      ]
    },
    {
      "comment_id": "lx0ij32",
      "body": "I love the flexibility of the program, so I would definitely recommend. The time it takes to finish is solely dependent on each individual and how much time they put it. Saving money for me is always a plus",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx0ij32/",
      "replies": [
        {
          "comment_id": "lx0lxkd",
          "body": "Love that! I’m all about accelerated learning. At my CC I thrived in 4 wk and 6 wk classes. And I did tons of Sophia credits in a few weeks. For me the slower a semester goes, the less engaged I am. 😩",
          "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx0lxkd/",
          "replies": []
        }
      ]
    },
    {
      "comment_id": "lx0ouoy",
      "body": "I am in the psychology program, not nursing, but still under the School of Health. The classes have taken me between a couple of days and a couple of weeks, and that's with reading and watching all of the course material.\n\nI'm faster at classes with writing assignments than proctored tests, but that's just my personal learning style. I also started a new job that's slowed me down a bit since I'm adjusting to overnights. I'm also doing a lot of online training during my shifts, making finding the motivation for school after work more challenging.\n\nI'd 100% recommend going for it. I wish I had completed my first bachelor's at WGU. I would have saved so much time and money.\n\nEditing to add a link to apply: [https://infl.tv/ozSR](https://infl.tv/ozSR)",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx0ouoy/",
      "replies": [
        {
          "comment_id": "lx0rt2o",
          "body": "Oh thank you so much! Honestly if WGU had a philosophy program I would already be enrolled. \n\nI’m finishing up my Philosophy AA rn at my CC while I’m enrolled in nursing school for my ASN. Just happened that way. Since I read philosophy majors do well in IT, I figured I’d just go for informatics later on.",
          "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx0rt2o/",
          "replies": []
        }
      ]
    },
    {
      "comment_id": "lx16wu4",
      "body": "I am in the pre licensure to BSN program. I’m 2 weeks into my first class and I need to take the OA so I’m almost done. I’m trying to accelerate my program. So far what I like to do is take the pre assessment and see specifically what I need to study so I can get through the class without getting caught in the fluff. I wish I would have done as many of the credits as I could on Sophia learning though",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx16wu4/",
      "replies": []
    },
    {
      "comment_id": "lx3diny",
      "body": "I just finished my Bachelors at WGU and I highly recommend it! I’m not in nursing so I can’t speak to that specific program, but overall WGU is amazing! I finished my program in only 8 months and had 23 courses, so you could most likely finish yours in one 6 month term and save a ton of money!",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx3diny/",
      "replies": []
    },
    {
      "comment_id": "lx3h5a6",
      "body": "WGU is great for those who are motivated. You can spend more time on courses you need to and less on those you already know. WGU does not want you in school so that they can collect money; they want you there to learn and get you into the workforce when you're ready. Proving competency prepares you for entering the field in a great way. I highly recommend it to anyone serious about finishing school for reasonable pricing.",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx3h5a6/",
      "replies": []
    },
    {
      "comment_id": "lx3s00h",
      "body": "Congrats on exploring your degree options! Not a nursing student here, but Public Health. I've found the classes incredibly enjoyable so far!",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx3s00h/",
      "replies": []
    },
    {
      "comment_id": "lx13kbe",
      "body": "Though I am at wgu for psych, I can say that their programs are well rounded and the prices are really good. If I don't get into grad school next year, my plan is to come back to wgu for my bsn",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/lx13kbe/",
      "replies": []
    },
    {
      "comment_id": "m9c0mqj",
      "body": "Do you or anyone you know in the BSN program have a good discord channel link?",
      "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/m9c0mqj/",
      "replies": [
        {
          "comment_id": "nbgjkie",
          "body": "Did you ever find anything?",
          "permalink": "https://reddit.com/r/WGU/comments/1ggolwa/thinking_of_rnbsn/nbgjkie/",
          "replies": []
        }
      ]
    }
  ]
}