{
  "post": {
    "post_id": "1l9mifs",
    "title": "RN Considering WGU MBA — General vs Healthcare Management?",
    "selftext": "Hey everyone, reposting this since I didn’t really get many responses the first time: I’m a Canadian RN with a BSN and about 4 years of experience split between psych and corrections nursing. I’m currently working as a travel nurse in the U.S. and considering going back to Canada in a couple years. While I enjoy my work for now, I’ve been thinking seriously about the long game and how to open up more career options down the line — especially something that could eventually get me into the $150K+ range. I’ve narrowed it down to either WGU’s General MBA or the MBA in Healthcare Management, but I’m stuck on which one makes more sense for someone with a nursing background. Right now I’m leaning towards the Healthcare MBA. Again, I don’t hate nursing — I actually enjoy it — but I want to have a degree that gives me flexibility if I ever want to step away from bedside work or get into leadership, consulting, informatics, or health tech strategy roles. This is also the reason I don’t wanna get an MSN. Questions for any nurses here who’ve done either MBA at WGU: - Which one did you choose and why? - What kind of roles did you end up in (if you pivoted)? - Was it respected or helpful in getting you interviews? - Did it actually change your earning potential? If anyone has experience specifically in mental health, public health, consulting, or even just moving into admin from bedside after the degree, I’d love to hear how it played out. Thanks in advance — and congrats to anyone who’s already finished their degree! 👏",
    "permalink": "https://reddit.com/r/WGU/comments/1l9mifs/rn_considering_wgu_mba_general_vs_healthcare/"
  },
  "comments": [
    {
      "comment_id": "mxe1av4",
      "body": "RN here, I did the MBA - Healthcare Management program in 2022. There were only 2 classes that differed, Service Line Development and Accreditation Audit. After graduating, I moved into Administration and now manage a remote team. My salary increased from 129K to 169K (this year). I didn’t hear any concerns about the degree coming from WGU, many nursing moving into admin have WGU degrees now.",
      "permalink": "https://reddit.com/r/WGU/comments/1l9mifs/rn_considering_wgu_mba_general_vs_healthcare/mxe1av4/",
      "replies": []
    },
    {
      "comment_id": "mxdq0me",
      "body": "Unless you want to get out of the healthcare industry eventually, I would go with the healthcare MBA. It’s always good experience, and narrative, for leadership to have individual contributor experience in the industry they are leading within.",
      "permalink": "https://reddit.com/r/WGU/comments/1l9mifs/rn_considering_wgu_mba_general_vs_healthcare/mxdq0me/",
      "replies": [
        {
          "comment_id": "mxdsjqr",
          "body": "Yeah I was thinking about it for the tie into my current industry experience as well. I wouldn’t be fully closed off to leaving the healthcare industry later on maybe 10 years or so from now. But i definitely feel like the only way for me to get my foot in the door is initially through healthcare",
          "permalink": "https://reddit.com/r/WGU/comments/1l9mifs/rn_considering_wgu_mba_general_vs_healthcare/mxdsjqr/",
          "replies": []
        }
      ]
    },
    {
      "comment_id": "n1tgo1t",
      "body": "Does anyone have any info about an mba vs msn admin/leadership? Or maybe both? Any thoughts?",
      "permalink": "https://reddit.com/r/WGU/comments/1l9mifs/rn_considering_wgu_mba_general_vs_healthcare/n1tgo1t/",
      "replies": []
    }
  ]
}